---
kind: type
id: T:Autodesk.Revit.DB.Structure.MultiplanarOption
source: html/37cc5a15-0771-41dd-4456-6820c7cef725.htm
---
# Autodesk.Revit.DB.Structure.MultiplanarOption

Input argument type for Rebar.GetCenterlineCurves method.
 Controls whether all curves of a multi-planar Rebar element are returned by
 GetCenterlineCurves, or only the curves in the primary plane.

## Syntax (C#)
```csharp
public enum MultiplanarOption
```